---
kind: type
id: T:Autodesk.Revit.DB.FillPatternHostOrientation
source: html/77580679-4563-f4f8-0253-af7215d4dea6.htm
---
# Autodesk.Revit.DB.FillPatternHostOrientation

The types of orientations for fill patterns.

## Syntax (C#)
```csharp
public enum FillPatternHostOrientation
```